import React from 'react';
import './translate.css';

const Translate = () => {
  return (
    <div id="translate" className='translate-container'>
      {/* <textarea className='input-text' placeholder='Enter text to translate...'></textarea>
      <button className='translate-button'>Translate</button> */}
      <div className='translate_head'>
        <h2>Translated Text</h2>
      </div>
      <table>

<tr>
<th>Malvi</th>
<th>Hindi</th>
</tr>

<tr>
<td>करें अगर चोरिया पापा की परिया रे तो सोरा काई रे, सोरा पापा का घोड़रोज।</td>
<td>क्यों रे, अगर लड़कियाँ पापा की परियाँ हैं तो लड़के क्या हैं, लड़के पापा के नीलगाय।</td>
</tr>

<tr>
<td>ओर अबरके, कत्रिक लासना वसना वाई अबरके, लासना दो तीन विगा की वाई यार, तो कई भाव वाव आगा के नि आगा, देखो भाव तो असो है, आएग्यो तो महिंद्रा की थार ले सकूं, नि आयो तो दयचा का ठमाधा भी वेचना पड़ेगा।</td>
<td>और इस साल कितनी लहसुन बोई, लहसुन तो दो तीन बीगा की बोई यार, तो फिर भाव आएगा या नहीं, देखो भाव का तो ऐसा है अगर आ गया तो महिंद्रा थार आ जाएगी नहीं तो दहेज के बर्तन भी बेचना पड़ जाए।</td>
</tr>

<tr>
<td>करे कसा बिस्कुट खायरो, ई टेगधा वारा। तारी सकल देकीं एज बिस्कुट दीदा वेगा दुकान वारा ने। तू भी खायरो, नि नि बस ठीक है।</td>
<td>क्यों रे, कौनसे बिस्किट खा रहा, ये कुत्ते वाला। तेरी शकल देख कर यही वाले बिस्किट दिए होंगे दुकानवाले ने तुझे। तुझे खाना है, नहीं, बस ठीक है।</td>
</tr>

<tr>
<td>आको दान पतंग उड़ाई रायो तो, घरे आता ही खड़ा उढ़्या।</td>
<td>पूरा दिन पतंग उड़ा रहा था, घर आते ही जूते उड़ने लगे।</td>
</tr>


<tr>
<td>लुगाई लानी तो अशी लानी के सुबह-सुबह प्यार ती केवे, कावो उठो नि मू थाके चाई वनाई री, ने मू गुस्सा ती कू, का मू कय टपेली में हुट्टो कई।</td>
<td>पत्नी ऐसी लाना कि सुबह सुबह प्यार से कहे, क्यों जी उठो ना, मैं आपके लिए चाय बना रही हूँ,और मैं गुस्से में कहूं, क्यों, मैं क्या चाय के बर्तन में सोया हूँ?</td>
</tr>


<tr>
<td>भाई साहब, बाप दादा बलगढ़िया चलाधी चलाधी ने खपरा विग्या ने आजकल की ऊलड़ा बुलेट मांगीरी, डाइको विकी जगा, मान लो।</td>
<td>भाई साहब, बाप दादा बेलगाड़ी चला चला कर बुढ़े हो गए और आजकल के बेटे बुलेट मांग रहे हैं, दहेज बिक जाएगा, मान लो।</td>
</tr>


<tr>
<td>मम्मी, मेरो मोबाइल खराब विग्यो।</td>
<td>मम्मी, मेरा मोबाइल खराब हो गया।</td>
</tr>



</table>
    </div>
  );
}

export default Translate;
